Конфигурация/Documents/ИнвентаризацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийИд</Name>
					<Comment>UUID сессии удалённого переучёта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетноеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедостачиИзлишков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/ИнвентаризацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
// =========================================================================
// ПОДКЛЮЧЕНИЕ ОБОРУДОВАНИЯ (БПО)
// =========================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование: разрешить использование сканера
	ИспользоватьПодключаемоеОборудование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование: подключение сканера штрихкодов при открытии формы
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование: отключение оборудования при закрытии формы
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

// =========================================================================
// АППАРАТНЫЙ СКАНЕР ШТРИХКОДОВ
// =========================================================================

// Обработка оповещений от МенеджераОборудования.
// При сканировании штрихкода — находит/добавляет товар в ТЧ Товары
// и увеличивает фактическое количество.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// БПО: события от подключаемого оборудования (сканер штрихкодов)
	Если ИмяСобытия = "ScanData" И Источник = "ПодключаемоеОборудование" Тогда
		// Новый формат БПО — структура с полем Штрихкод
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Штрихкод") Тогда
			ОбработатьШтрихкодСканера(Параметр.Штрихкод);
		// Старый формат БПО — массив
		ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") И Параметр.Количество() > 0 Тогда
			ОбработатьШтрихкодСканера(Параметр[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработка штрихкода от аппаратного сканера.
// Ищет товар, добавляет строку в ТЧ или увеличивает фактическое количество.
// Если товар не найден — предлагает создать новый.
//
&НаКлиенте
Процедура ОбработатьШтрихкодСканера(Штрихкод)
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		ДопПараметры = Новый Структура("Штрихкод", Штрихкод);
		Оповещение = Новый ОписаниеОповещения("СоздатьНовыйТоварОтвет", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение,
			"Товар с штрихкодом """ + Штрихкод + """ не найден." + Символы.ПС + "Создать новый товар?",
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ДобавитьТоварВТабличнуюЧасть(НайденнаяНоменклатура, Штрихкод);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйТоварОтвет(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИсходныйШтрихкод", ДопПараметры.Штрихкод);
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияНоменклатуры", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияНоменклатуры(Результат, ДопПараметры) Экспорт
	
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(ДопПараметры.Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьТоварВТабличнуюЧасть(НайденнаяНоменклатура, ДопПараметры.Штрихкод);
	
КонецПроцедуры

// Добавление товара в инвентаризацию или увеличение фактического количества.
// При сканировании: если товар уже есть в ТЧ — увеличивает ФактКол на 1.
// Если товара нет — добавляет новую строку с ФактКол = 1.
//
&НаКлиенте
Процедура ДобавитьТоварВТабличнуюЧасть(НоменклатураСсылка, Штрихкод)
	
	// Ищем существующую строку с таким товаром
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если СтрокаТЧ.Номенклатура = НоменклатураСсылка Тогда
			СтрокаТЧ.ФактическоеКоличество = СтрокаТЧ.ФактическоеКоличество + 1;
			СтрокаТЧ.Сумма = СтрокаТЧ.ФактическоеКоличество * СтрокаТЧ.Цена;
			РассчитатьОтклонение(СтрокаТЧ);
			РассчитатьСуммуНедостачиИзлишков(СтрокаТЧ);
			Элементы.Товары.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
			Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыФактическоеКоличество;
			ПересчитатьИтоги();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Товар не в таблице — добавляем новую строку
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураСсылка;
	НоваяСтрока.Штрихкод = Штрихкод;
	НоваяСтрока.ФактическоеКоличество = 1;
	
	// Получаем учётное количество и цену с сервера
	СтруктураДанных = ПолучитьДанныеНоменклатурыНаСервере(НоменклатураСсылка, Объект.Склад);
	НоваяСтрока.УчетноеКоличество = СтруктураДанных.Остаток;
	НоваяСтрока.Цена = СтруктураДанных.Цена;
	НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.ФактическоеКоличество;
	РассчитатьОтклонение(НоваяСтрока);
	РассчитатьСуммуНедостачиИзлишков(НоваяСтрока);
	
	Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыФактическоеКоличество;
	ПересчитатьИтоги();
	
КонецПроцедуры

// --- 1. КОМАНДА "ЗАПОЛНИТЬ ПО ОСТАТКАМ" ---

&НаКлиенте
Процедура Заполнить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	// Создаем "обещание" (описание оповещения), какую процедуру запустить после ответа пользователя
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
	
	// Асинхронный вызов диалога
	ПоказатьВопрос(Оповещение, "Табличная часть будет очищена и заполнена текущими остатками. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// Эта процедура запустится сама, когда пользователь нажмет кнопку в диалоге
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// 1. Конвертируем данные формы в реальный объект Документ
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// 2. Вызываем процедуру из модуля объекта (очистка теперь внутри)
	ДокументОбъект.ЗаполнитьПоОстаткам();
	
	// 3. Возвращаем данные обратно на форму
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	
КонецПроцедуры

// --- 2. ОБРАБОТКА ВЫБОРА ТОВАРА (При выборе товара остаток тоже заполняется) ---

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		// Получаем остаток и цену с сервера
		СтруктураДанных = ПолучитьДанныеНоменклатурыНаСервере(ТекСтрока.Номенклатура, Объект.Склад);
		
		ТекСтрока.УчетноеКоличество = СтруктураДанных.Остаток;
		ТекСтрока.Цена = СтруктураДанных.Цена;
		
		// По умолчанию ставим Факт = 0 (нужно пересчитать)
		ТекСтрока.ФактическоеКоличество = 0;
		ТекСтрока.Сумма = 0;
		
		РассчитатьОтклонение(ТекСтрока);
		РассчитатьСуммуНедостачиИзлишков(ТекСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

// --- 2.1 ОБРАБОТКА ШТРИХКОДА (Поиск номенклатуры по штрихкоду) ---

&НаКлиенте
Асинх Процедура ТоварыШтрихкодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на пустой штрихкод
	Если ПустаяСтрока(ТекущиеДанные.Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск номенклатуры по штрихкоду
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(ТекущиеДанные.Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		
		// Товар не найден - показываем предупреждение
		Ждать ПредупреждениеАсинх("Товар с штрихкодом """ + ТекущиеДанные.Штрихкод + """ не найден!");
		ТекущиеДанные.Штрихкод = "";
		Возврат;
		
	КонецЕсли;
	
	// Заполняем номенклатуру
	ТекущиеДанные.Номенклатура = НайденнаяНоменклатура;
	
	// Получаем данные товара (остатки и цену)
	СтруктураДанных = ПолучитьДанныеНоменклатурыНаСервере(НайденнаяНоменклатура, Объект.Склад);
	
	ТекущиеДанные.УчетноеКоличество = СтруктураДанных.Остаток;
	ТекущиеДанные.Цена = СтруктураДанных.Цена;
	
	// По умолчанию ставим Факт = 0 (нужно пересчитать)
	ТекущиеДанные.ФактическоеКоличество = 0;
	ТекущиеДанные.Сумма = 0;
	
	РассчитатьОтклонение(ТекущиеДанные);
	РассчитатьСуммуНедостачиИзлишков(ТекущиеДанные);
	
КонецПроцедуры

// --- 3. АВТО-РАСЧЕТ ОТКЛОНЕНИЯ (При изменении количеств руками) ---

&НаКлиенте
Процедура ТоварыФактическоеКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		// Пересчитываем сумму
		ТекСтрока.Сумма = ТекСтрока.ФактическоеКоличество * ТекСтрока.Цена;
		РассчитатьОтклонение(ТекСтрока);
		РассчитатьСуммуНедостачиИзлишков(ТекСтрока);
		ПересчитатьИтоги();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУчетноеКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьОтклонение(ТекСтрока);
	РассчитатьСуммуНедостачиИзлишков(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОтклонение(ТекСтрока)
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.Отклонение = ТекСтрока.ФактическоеКоличество - ТекСтрока.УчетноеКоличество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНедостачиИзлишков(ТекСтрока)
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.СуммаНедостачиИзлишков = ТекСтрока.Отклонение * ТекСтрока.Цена;
	КонецЕсли;
КонецПроцедуры

// --- СЛУЖЕБНЫЕ ФУНКЦИИ ---

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыНаСервере(Номенклатура, Склад)
	
	Результат = Новый Структура("Остаток, Цена", 0, 0);
	
	Если Не ЗначениеЗаполнено(Номенклатура) ИЛИ Не ЗначениеЗаполнено(Склад) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Получаем остаток
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Период,
		|			Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Остаток = Выборка.Остаток;
	КонецЕсли;
	
	// Получаем закупочную цену из регистра ЦеныНоменклатуры с типом "Закупочная"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|\tЦеныНоменклатуры.Цена КАК Цена
		|ИЗ
		|\tРегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|\tЦеныНоменклатуры.Номенклатура = &Номенклатура
		|\tИ ЦеныНоменклатуры.ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.Закупочная);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ВыборкаЦена = Запрос.Выполнить();
	
	Если Не ВыборкаЦена.Пустой() Тогда
		ВыборкаЦена = ВыборкаЦена.Выбрать();
		ВыборкаЦена.Следующий();
		Результат.Цена = ВыборкаЦена.Цена;
	Иначе
		Результат.Цена = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоШтрихкоду(Штрихкод)
	
	// Поиск в регистре Штрихкоды
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Номенклатура;
	
КонецФункции

// --- ПЕРЕСЧЕТ ИТОГОВОЙ СУММЫ ---

&НаКлиенте
Процедура ПересчитатьИтоги()
	
	ИтоговаяСумма = 0;
	
	Для Каждого Стр Из Объект.Товары Цикл
		ИтоговаяСумма = ИтоговаяСумма + Стр.Сумма;
	КонецЦикла;
	
КонецПроцедуры

// --- ПЕЧАТЬ РЕЗУЛЬТАТОВ ИНВЕНТАРИЗАЦИИ ---

&НаКлиенте
Процедура НапечататьРезультат(Команда)
	
	// Формируем табличный документ на сервере
	ТабличныйДокумент = СформироватьПечатнуюФормуНаСервере();
	
	// Показываем в окне печати
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.ИнвентаризацияТоваров.ПолучитьМакет("МакетРезультатИнвентаризации");
	
	// Получаем области макета
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	// Заполняем параметры заголовка
	ОбластьЗаголовок.Параметры.НомерДокумента = Объект.Number;
	ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(Объект.Date, "ДФ='dd.MM.yyyy'");
	ОбластьЗаголовок.Параметры.Склад = Объект.Склад;
	
	// Выводим заголовок
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Выводим шапку таблицы
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	// Переменные для подсчета итогов
	ИтогоУчетное = 0;
	ИтогоФактическое = 0;
	ИтогоОтклонение = 0;
	ИтогоСумма = 0;
	ИтогоСуммаНедостачиИзлишков = 0;
	НомерСтроки = 0;
	
	// Выводим строки товаров
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Номенклатура = ТекСтрока.Номенклатура;
		ОбластьСтрока.Параметры.УчетноеКоличество = ТекСтрока.УчетноеКоличество;
		ОбластьСтрока.Параметры.ФактическоеКоличество = ТекСтрока.ФактическоеКоличество;
		ОбластьСтрока.Параметры.Отклонение = ТекСтрока.Отклонение;
		ОбластьСтрока.Параметры.Цена = ТекСтрока.Цена;
		ОбластьСтрока.Параметры.Сумма = ТекСтрока.Сумма;
		ОбластьСтрока.Параметры.СуммаНедостачиИзлишков = ТекСтрока.СуммаНедостачиИзлишков;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		// Накапливаем итоги
		ИтогоУчетное = ИтогоУчетное + ТекСтрока.УчетноеКоличество;
		ИтогоФактическое = ИтогоФактическое + ТекСтрока.ФактическоеКоличество;
		ИтогоОтклонение = ИтогоОтклонение + ТекСтрока.Отклонение;
		ИтогоСумма = ИтогоСумма + ТекСтрока.Сумма;
		ИтогоСуммаНедостачиИзлишков = ИтогоСуммаНедостачиИзлишков + ТекСтрока.СуммаНедостачиИзлишков;
		
	КонецЦикла;
	
	// Заполняем параметры подвала с итогами
	ОбластьПодвал.Параметры.ИтогоУчетное = ИтогоУчетное;
	ОбластьПодвал.Параметры.ИтогоФактическое = ИтогоФактическое;
	ОбластьПодвал.Параметры.ИтогоОтклонение = ИтогоОтклонение;
	ОбластьПодвал.Параметры.ИтогоСумма = ИтогоСумма;
	ОбластьПодвал.Параметры.ИтогоСуммаНедостачиИзлишков = ИтогоСуммаНедостачиИзлишков;
	
	// Выводим подвал
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
